{
	"2023": [
		{
			"title": "Avionics Intern @ SpaceX",
			"blurb": "I'm working at SpaceX again for the summer. I'm returning to the same team in Los Angeles and I'm super excited to be back!",
			"type": "Experience",
			"tags": ["DSP"]
		},
		{
			"title": "Embedded Dev @ Smartex.ai",
			"blurb": "I worked on the amazing embedded software team, helping to modernize and digitize the textile industry. There I developed the world's first system to accurately track production of fabric in metres using cameras.",
			"type": "Experience",
			"tags": ["FW", "Python"]
		},
		{
			"title": "Living in Portugal!",
			"blurb": "My internship at Smartex was in Porto, so I got to skip out on Canadian winter! I loved the city, the language, and hanging out with the people I met there. Smartex is an incredible company with amazing people.",
			"type": "Fun"
		}
	],
	"2022": [
		{
			"title": "Study Exchange in Madrid",
			"blurb": "After spending a year learning Spanish, I finally got the chance to live in Spain! I met people from all over the world and got to study in an amazing environment.",
			"type": "Fun"
		},
		{
			"title": "Deep Learning Dev @ ABR",
			"blurb": "A machine learning and data science coop! Although I've done quite a few personal projects in this area, being able to learn from experts and play with bleeding-edge models was an incredible experience.",
			"type": "Experience",
			"tags": ["AI", "Python"]
		},
		{
			"title": "PM @ UW Blueprint",
			"blurb": "I was the technical lead for half of this ten month project, leading a team of 6 devs to create a course platform for an Alberta-based NPO. I was then the PM for the other half, leading the designers and handoff.",
			"type": "Experience",
			"tags": ["PM", "Web"]
		}
	],
	"2021": [
		{
			"title": "Avionics Intern @ SpaceX",
			"blurb": "I got the chance to work at SpaceX! I was a sensor development intern for Starship Avionics, developing precise data pipelines, demodulation algorithms, and data fitting methods.",
			"type": "Experience",
			"tags": ["C", "FPGA", "DSP"]
		},
		{
			"title": "Summer in Los Angeles!",
			"blurb": "My SpaceX internship was in person, so I lived in LA for the summer! I surfed, rock climbed, bungee jumped, and got to make incredible friends that I will cherish forever.",
			"type": "Fun"
		},
		{
			"title": "CUTC Technology Lead",
			"blurb": "As a part of the Canadian Undergraduate Technology Conference I lead the technology team, which provides the infrastructure to allow the conference to function. We primarily focused on registration, the website, and the blog.",
			"type": "Experience",
			"tags": ["Web", "Vue", "PHP"]
		},
		{
			"title": "FPGA AI Processor",
			"blurb": "I designed and implemented a verilog design that performed neural network inferences. It runs on a FPGA simulation and can run any binarized neural network. This project was a dive into Verilog and AI optimization.",
			"type": "Project",
			"tags": ["FPGA", "AI"]
		}
	],
	"2020": [
		{
			"title": "Firmware Security @ AMD",
			"blurb": "I developed communication systems inside new APUs while maintaining security and efficiency. Although is was completely remote, I'm still very thankful because I got to work with incredibly smart people.",
			"type": "Experience",
			"tags": ["C", "FW"]
		},
		{
			"title": "Passion Finding App",
			"blurb": "I made this app to help people explore concepts and ideas in a non-linear way. Users can explore a 2D map of interests and see how they see themselves in it. This took lots of data analysis, app design, and development!",
			"type": "Project",
			"tags": ["App Dev", "Flutter", "GCP"]
		},
		{
			"title": "AI Acceleration Engineering @ Untether AI",
			"blurb": "My first tech job ever! I worked in Toronto for both the Hardware and Software teams; I helped build their SoC verification suite and the drivers that transfered data to and from their chip!",
			"type": "Experience",
			"tags": ["C", "Python"]
		},
		{
			"title": "Vibeify: An AI DJ",
			"blurb": "At QHacks2020 we built a website that tracks the 'vibe' of a room (using motion data) and plays music accordingly.",
			"type": "Project",
			"tags": ["Web", "React", "AI"]
		}
	],
	"2019": [
		{
			"title": "Started University at Waterloo!",
			"blurb": "I began my first term in September! I met amazing people, played Varsity Ultimate Frisbee, and lived on my own for the first real time.",
			"type": "Fun"
		},
		{
			"title": "Camp Counselour",
			"blurb": "I worked at Camp Couchiching after being a camper there for 10 years. I got to spend lots of time with some really amazing kids.",
			"type": "Experience"
		},
		{
			"title": "Shad at UCalgary",
			"blurb": "In July I went to Calgary and worked with an amazing group, developing a product focused on environmental sustainability. I got to play a lot of Ultimate Frisbee, visit some tourist destinations, and camp! I even got to be the Valedictorian :)",
			"type": "Fun"
		},
		{
			"title": "Four bit Computer",
			"blurb": "I spent six months breadboarding, designing, and building a fully programmable four bit computer - it was the most intense hardware project I've built. The final product is a printed circuit board with a 3D-printed case a laser-cut acryllic cover.",
			"type": "Project",
			"tags": ["Electrical", "PCB"],
			"link": "/chump"
		},
		{
			"title": "Student Theatre Festival",
			"blurb": "I organized and hosted a student-run threatre festival with plays, a magician, musical acts, and improv. I have also wrote a play and directed, acted, and ran audio for the entire show. This is my favourite memory from highschool.",
			"type": "Fun",
			"tags": ["Acting", "Directing"]
		},
		{
			"title": "Flexible PCB Snake Game",
			"blurb": "I designed & soldered a custom SMT PCB with an LED matrix and a solar panel. As an added challenge, the entire game was programmed in Assembly (600+ lines)",
			"type": "Project",
			"tags": ["Electrical", "PCB"]
		}
	]
}