{
	"2021": [
		{
			"title": "Avionics Intern @ SpaceX",
			"blurb": "I'm working at SpaceX this summer! I am on the Starship Avionics team, developing signal processing systems to gather accurate data. Hopefully this will help get Starship to the Moon and Mars!",
			"type": "Experience",
			"tags": ["C", "DSP"]
		},
		{
			"title": "CUTC Technology Lead",
			"blurb": "As a part of the Canadian Undergraduate Technology Conference, my team provides the infrastructure to allow the conference to function. We are currently focusing on registration, the website, and the blog.",
			"type": "Experience",
			"tags": ["Web", "Vue", "PHP"]
		},
		{
			"title": "FPGA AI Processor",
			"blurb": "I designed and implemented a circuit that performance neural network inferences. This project was a dive into Verilog and AI efficiency.",
			"type": "Project",
			"tags": ["Verilog", "AI"]
		}
	],
	"2020": [
		{
			"title": "Firmware Security @ AMD",
			"blurb": "I developed communication systems inside their new APUs while maintaining security and efficiency. Although is was completely remote, I'm still very thankful because I got to work with incredibly smart people.",
			"type": "Experience",
			"tags": ["C", "FW"]
		},
		{
			"title": "Passion Finding App",
			"blurb": "I made this app to help people explore concepts and ideas in a non-linear way. Users can explore a 2D map of interests and see how they see themselves in it. This took lots of data analysis, app design, and development!",
			"type": "Project",
			"tags": ["App Dev", "Flutter", "GCP"]
		},
		{
			"title": "AI Acceleration Engineering @ Untether AI",
			"blurb": "My first tech job ever! I worked in Toronto for both the Hardware and Software teams; I helped build their SoC verification suite and the drivers that transfered data to and from their chip!",
			"type": "Experience",
			"tags": ["C", "Python"]
		}
	],
	"2019": [
		{
			"title": "Started University at Waterloo!",
			"blurb": "I began my first term in September! I met amazing people, played Varsity Ultimate Frisbee, and lived on my own for the first real time.",
			"type": "Fun"
		},
		{
			"title": "Camp Counselour",
			"blurb": "I worked at Camp Couchiching after being a camper there for 10 years. I got to spend lots of time with some really amazing kids.",
			"type": "Fun"
		},
		{
			"title": "Shad at UCalgary",
			"blurb": "In July I went to Calgary and worked with an amazing group, developing a product focused on environmental sustainability. I got to play a lot of Ultimate Frisbee, visit some tourist destinations, and camp! I even got to be the Valedictorian :)",
			"type": "Fun"
		},
		{
			"title": "Student Theatre Festival",
			"blurb": "I organized and hosted a student-run threatre festival with plays, a magician, musical acts, and improv. I have also wrote a play and directed, acted, and ran audio for the entire show. This is my favourite memory from highschool.",
			"type": "Fun",
			"tags": ["Acting", "Directing"]
		},
		{
			"title": "Four bit Computer",
			"blurb": "I spent six months breadboarding, designing, and building a fully programmable four bit computer - it was the most intense hardware project I've built. The final product is a printed circuit board with a 3D-printed case a laser-cut acryllic cover.",
			"type": "Project",
			"tags": ["Circuitry", "Schematics"]
		}
	]
}